app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "uzo4000"], ["LIMIT", 1]]
---
    def create # POST /api/v1/login
        #user = User.find_by(username: params[:username])
        #render json: user

        user = User.find_by(username: params[:username])