app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties"
---
    def index
        properties = Property.all

SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def show
        property = Property.find(params[:id])