app/controllers/reservations_controller.rb

    def index
        reservations = Reservation.all
---
SELECT "reservations".* FROM "reservations"

    def show
        reservations = Reservation.where(user_id: params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1  [["user_id", 16]]

    def create
        reservation = Reservation.create(reservation_params)
---
INSERT INTO "reservations" ("user_id", "property_id", "start_date", "end_date") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 11], ["property_id", 9], ["start_date", "2020-05-07"], ["end_date", "2020-05-15"]]

    def update
        reservation = Reservation.find(params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]

    def destroy
        reservation = Reservation.find_by(id: params[:id])
        reservation.destroy
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
DELETE FROM "reservations" WHERE "reservations"."id" = $1  [["id", 37]]