app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews"
---
    def index
        reviews = Review.all

SELECT "properties".* FROM "properties"
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews"
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
    def show
        reviews = Review.all.select{|review| review.reservation.property.id == params[:id].to_i}

        reviews = reviews.map{|review| User.find(review.user_id)}