app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
    def profile
        token = request.headers["Authenticate"]
        user = User.find(decode(token)["user_id"])